frankenphp_experiment/benchmarking/results/apache-k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/k6-script.js
        output: -

     scenarios: (100.00%) 1 scenario, 150 max VUs, 5m15s max duration (incl. graceful stop):
              * default: Up to 150 looping VUs for 4m45s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 002/150 VUs, 1 complete and 0 interrupted iterations
default   [   0% ] 002/150 VUs  0m01.0s/4m45.0s

running (0m02.0s), 004/150 VUs, 6 complete and 0 interrupted iterations
default   [   1% ] 004/150 VUs  0m02.0s/4m45.0s

running (0m03.0s), 005/150 VUs, 14 complete and 0 interrupted iterations
default   [   1% ] 005/150 VUs  0m03.0s/4m45.0s

running (0m04.0s), 007/150 VUs, 24 complete and 0 interrupted iterations
default   [   1% ] 007/150 VUs  0m04.0s/4m45.0s

running (0m05.0s), 009/150 VUs, 36 complete and 0 interrupted iterations
default   [   2% ] 009/150 VUs  0m05.0s/4m45.0s

running (0m06.0s), 010/150 VUs, 54 complete and 0 interrupted iterations
default   [   2% ] 010/150 VUs  0m06.0s/4m45.0s

running (0m07.0s), 012/150 VUs, 74 complete and 0 interrupted iterations
default   [   2% ] 012/150 VUs  0m07.0s/4m45.0s

running (0m08.0s), 014/150 VUs, 99 complete and 0 interrupted iterations
default   [   3% ] 014/150 VUs  0m08.0s/4m45.0s

running (0m09.0s), 015/150 VUs, 125 complete and 0 interrupted iterations
default   [   3% ] 015/150 VUs  0m09.0s/4m45.0s

running (0m10.0s), 017/150 VUs, 154 complete and 0 interrupted iterations
default   [   4% ] 017/150 VUs  0m10.0s/4m45.0s

running (0m11.0s), 018/150 VUs, 189 complete and 0 interrupted iterations
default   [   4% ] 018/150 VUs  0m11.0s/4m45.0s

running (0m12.0s), 020/150 VUs, 224 complete and 0 interrupted iterations
default   [   4% ] 020/150 VUs  0m12.0s/4m45.0s

running (0m13.0s), 022/150 VUs, 256 complete and 0 interrupted iterations
default   [   5% ] 022/150 VUs  0m13.0s/4m45.0s

running (0m14.0s), 023/150 VUs, 300 complete and 0 interrupted iterations
default   [   5% ] 023/150 VUs  0m14.0s/4m45.0s

running (0m15.0s), 025/150 VUs, 347 complete and 0 interrupted iterations
default   [   5% ] 025/150 VUs  0m15.0s/4m45.0s

running (0m16.0s), 027/150 VUs, 396 complete and 0 interrupted iterations
default   [   6% ] 027/150 VUs  0m16.0s/4m45.0s

running (0m17.0s), 028/150 VUs, 433 complete and 0 interrupted iterations
default   [   6% ] 028/150 VUs  0m17.0s/4m45.0s

running (0m18.0s), 030/150 VUs, 483 complete and 0 interrupted iterations
default   [   6% ] 030/150 VUs  0m18.0s/4m45.0s

running (0m19.0s), 032/150 VUs, 544 complete and 0 interrupted iterations
default   [   7% ] 032/150 VUs  0m19.0s/4m45.0s

running (0m20.0s), 033/150 VUs, 607 complete and 0 interrupted iterations
default   [   7% ] 033/150 VUs  0m20.0s/4m45.0s

running (0m21.0s), 035/150 VUs, 673 complete and 0 interrupted iterations
default   [   7% ] 035/150 VUs  0m21.0s/4m45.0s

running (0m22.0s), 036/150 VUs, 744 complete and 0 interrupted iterations
default   [   8% ] 036/150 VUs  0m22.0s/4m45.0s

running (0m23.0s), 038/150 VUs, 807 complete and 0 interrupted iterations
default   [   8% ] 038/150 VUs  0m23.0s/4m45.0s

running (0m24.0s), 040/150 VUs, 863 complete and 0 interrupted iterations
default   [   8% ] 040/150 VUs  0m24.0s/4m45.0s

running (0m25.0s), 041/150 VUs, 941 complete and 0 interrupted iterations
default   [   9% ] 041/150 VUs  0m25.0s/4m45.0s

running (0m26.0s), 043/150 VUs, 1023 complete and 0 interrupted iterations
default   [   9% ] 043/150 VUs  0m26.0s/4m45.0s

running (0m27.0s), 045/150 VUs, 1110 complete and 0 interrupted iterations
default   [   9% ] 045/150 VUs  0m27.0s/4m45.0s

running (0m28.0s), 046/150 VUs, 1190 complete and 0 interrupted iterations
default   [  10% ] 046/150 VUs  0m28.0s/4m45.0s

running (0m29.0s), 048/150 VUs, 1276 complete and 0 interrupted iterations
default   [  10% ] 048/150 VUs  0m29.0s/4m45.0s

running (0m30.0s), 049/150 VUs, 1373 complete and 0 interrupted iterations
default   [  11% ] 049/150 VUs  0m30.0s/4m45.0s

running (0m31.0s), 050/150 VUs, 1458 complete and 0 interrupted iterations
default   [  11% ] 050/150 VUs  0m31.0s/4m45.0s

running (0m32.0s), 051/150 VUs, 1545 complete and 0 interrupted iterations
default   [  11% ] 051/150 VUs  0m32.0s/4m45.0s

running (0m33.0s), 052/150 VUs, 1647 complete and 0 interrupted iterations
default   [  12% ] 052/150 VUs  0m33.0s/4m45.0s

running (0m34.0s), 053/150 VUs, 1751 complete and 0 interrupted iterations
default   [  12% ] 053/150 VUs  0m34.0s/4m45.0s

running (0m35.0s), 054/150 VUs, 1856 complete and 0 interrupted iterations
default   [  12% ] 054/150 VUs  0m35.0s/4m45.0s

running (0m36.0s), 054/150 VUs, 1957 complete and 0 interrupted iterations
default   [  13% ] 054/150 VUs  0m36.0s/4m45.0s

running (0m37.0s), 055/150 VUs, 2060 complete and 0 interrupted iterations
default   [  13% ] 055/150 VUs  0m37.0s/4m45.0s

running (0m38.0s), 056/150 VUs, 2167 complete and 0 interrupted iterations
default   [  13% ] 056/150 VUs  0m38.0s/4m45.0s

running (0m39.0s), 057/150 VUs, 2253 complete and 0 interrupted iterations
default   [  14% ] 057/150 VUs  0m39.0s/4m45.0s

running (0m40.0s), 058/150 VUs, 2358 complete and 0 interrupted iterations
default   [  14% ] 058/150 VUs  0m40.0s/4m45.0s

running (0m41.0s), 059/150 VUs, 2474 complete and 0 interrupted iterations
default   [  14% ] 059/150 VUs  0m41.0s/4m45.0s

running (0m42.0s), 059/150 VUs, 2592 complete and 0 interrupted iterations
default   [  15% ] 059/150 VUs  0m42.0s/4m45.0s

running (0m43.0s), 060/150 VUs, 2693 complete and 0 interrupted iterations
default   [  15% ] 060/150 VUs  0m43.0s/4m45.0s

running (0m44.0s), 061/150 VUs, 2787 complete and 0 interrupted iterations
default   [  15% ] 061/150 VUs  0m44.0s/4m45.0s

running (0m45.0s), 062/150 VUs, 2896 complete and 0 interrupted iterations
default   [  16% ] 062/150 VUs  0m45.0s/4m45.0s

running (0m46.0s), 063/150 VUs, 3019 complete and 0 interrupted iterations
default   [  16% ] 063/150 VUs  0m46.0s/4m45.0s

running (0m47.0s), 064/150 VUs, 3145 complete and 0 interrupted iterations
default   [  16% ] 064/150 VUs  0m47.0s/4m45.0s

running (0m48.0s), 064/150 VUs, 3273 complete and 0 interrupted iterations
default   [  17% ] 064/150 VUs  0m48.0s/4m45.0s

running (0m49.0s), 065/150 VUs, 3385 complete and 0 interrupted iterations
default   [  17% ] 065/150 VUs  0m49.0s/4m45.0s

running (0m50.0s), 066/150 VUs, 3495 complete and 0 interrupted iterations
default   [  18% ] 066/150 VUs  0m50.0s/4m45.0s

running (0m51.0s), 067/150 VUs, 3604 complete and 0 interrupted iterations
default   [  18% ] 067/150 VUs  0m51.0s/4m45.0s

running (0m52.0s), 068/150 VUs, 3726 complete and 0 interrupted iterations
default   [  18% ] 068/150 VUs  0m52.0s/4m45.0s

running (0m53.0s), 069/150 VUs, 3820 complete and 0 interrupted iterations
default   [  19% ] 069/150 VUs  0m53.0s/4m45.0s

running (0m54.0s), 069/150 VUs, 3951 complete and 0 interrupted iterations
default   [  19% ] 069/150 VUs  0m54.0s/4m45.0s

running (0m55.0s), 070/150 VUs, 4087 complete and 0 interrupted iterations
default   [  19% ] 070/150 VUs  0m55.0s/4m45.0s

running (0m56.0s), 071/150 VUs, 4212 complete and 0 interrupted iterations
default   [  20% ] 071/150 VUs  0m56.0s/4m45.0s

running (0m57.0s), 072/150 VUs, 4350 complete and 0 interrupted iterations
default   [  20% ] 072/150 VUs  0m57.0s/4m45.0s

running (0m58.0s), 073/150 VUs, 4483 complete and 0 interrupted iterations
default   [  20% ] 073/150 VUs  0m58.0s/4m45.0s

running (0m59.0s), 074/150 VUs, 4626 complete and 0 interrupted iterations
default   [  21% ] 074/150 VUs  0m59.0s/4m45.0s

running (1m00.0s), 074/150 VUs, 4761 complete and 0 interrupted iterations
default   [  21% ] 074/150 VUs  1m00.0s/4m45.0s

running (1m01.0s), 075/150 VUs, 4907 complete and 0 interrupted iterations
default   [  21% ] 075/150 VUs  1m01.0s/4m45.0s

running (1m02.0s), 076/150 VUs, 5049 complete and 0 interrupted iterations
default   [  22% ] 076/150 VUs  1m02.0s/4m45.0s

running (1m03.0s), 077/150 VUs, 5194 complete and 0 interrupted iterations
default   [  22% ] 077/150 VUs  1m03.0s/4m45.0s

running (1m04.0s), 078/150 VUs, 5341 complete and 0 interrupted iterations
default   [  22% ] 078/150 VUs  1m04.0s/4m45.0s

running (1m05.0s), 079/150 VUs, 5480 complete and 0 interrupted iterations
default   [  23% ] 079/150 VUs  1m05.0s/4m45.0s

running (1m06.0s), 079/150 VUs, 5630 complete and 0 interrupted iterations
default   [  23% ] 079/150 VUs  1m06.0s/4m45.0s

running (1m07.0s), 080/150 VUs, 5788 complete and 0 interrupted iterations
default   [  24% ] 080/150 VUs  1m07.0s/4m45.0s

running (1m08.0s), 081/150 VUs, 5934 complete and 0 interrupted iterations
default   [  24% ] 081/150 VUs  1m08.0s/4m45.0s

running (1m09.0s), 082/150 VUs, 6092 complete and 0 interrupted iterations
default   [  24% ] 082/150 VUs  1m09.0s/4m45.0s

running (1m10.0s), 083/150 VUs, 6248 complete and 0 interrupted iterations
default   [  25% ] 083/150 VUs  1m10.0s/4m45.0s

running (1m11.0s), 084/150 VUs, 6403 complete and 0 interrupted iterations
default   [  25% ] 084/150 VUs  1m11.0s/4m45.0s

running (1m12.0s), 084/150 VUs, 6559 complete and 0 interrupted iterations
default   [  25% ] 084/150 VUs  1m12.0s/4m45.0s

running (1m13.0s), 085/150 VUs, 6711 complete and 0 interrupted iterations
default   [  26% ] 085/150 VUs  1m13.0s/4m45.0s

running (1m14.0s), 086/150 VUs, 6873 complete and 0 interrupted iterations
default   [  26% ] 086/150 VUs  1m14.0s/4m45.0s

running (1m15.0s), 087/150 VUs, 7005 complete and 0 interrupted iterations
default   [  26% ] 087/150 VUs  1m15.0s/4m45.0s

running (1m16.0s), 088/150 VUs, 7167 complete and 0 interrupted iterations
default   [  27% ] 088/150 VUs  1m16.0s/4m45.0s

running (1m17.0s), 089/150 VUs, 7331 complete and 0 interrupted iterations
default   [  27% ] 089/150 VUs  1m17.0s/4m45.0s

running (1m18.0s), 089/150 VUs, 7498 complete and 0 interrupted iterations
default   [  27% ] 089/150 VUs  1m18.0s/4m45.0s

running (1m19.0s), 090/150 VUs, 7668 complete and 0 interrupted iterations
default   [  28% ] 090/150 VUs  1m19.0s/4m45.0s

running (1m20.0s), 091/150 VUs, 7843 complete and 0 interrupted iterations
default   [  28% ] 091/150 VUs  1m20.0s/4m45.0s

running (1m21.0s), 092/150 VUs, 8015 complete and 0 interrupted iterations
default   [  28% ] 092/150 VUs  1m21.0s/4m45.0s

running (1m22.0s), 093/150 VUs, 8188 complete and 0 interrupted iterations
default   [  29% ] 093/150 VUs  1m22.0s/4m45.0s

running (1m23.0s), 094/150 VUs, 8363 complete and 0 interrupted iterations
default   [  29% ] 094/150 VUs  1m23.0s/4m45.0s

running (1m24.0s), 094/150 VUs, 8532 complete and 0 interrupted iterations
default   [  29% ] 094/150 VUs  1m24.0s/4m45.0s

running (1m25.0s), 095/150 VUs, 8715 complete and 0 interrupted iterations
default   [  30% ] 095/150 VUs  1m25.0s/4m45.0s

running (1m26.0s), 096/150 VUs, 8897 complete and 0 interrupted iterations
default   [  30% ] 096/150 VUs  1m26.0s/4m45.0s

running (1m27.0s), 097/150 VUs, 9079 complete and 0 interrupted iterations
default   [  31% ] 097/150 VUs  1m27.0s/4m45.0s

running (1m28.0s), 098/150 VUs, 9256 complete and 0 interrupted iterations
default   [  31% ] 098/150 VUs  1m28.0s/4m45.0s

running (1m29.0s), 099/150 VUs, 9436 complete and 0 interrupted iterations
default   [  31% ] 099/150 VUs  1m29.0s/4m45.0s

running (1m30.0s), 099/150 VUs, 9623 complete and 0 interrupted iterations
default   [  32% ] 099/150 VUs  1m30.0s/4m45.0s

running (1m31.0s), 100/150 VUs, 9817 complete and 0 interrupted iterations
default   [  32% ] 100/150 VUs  1m31.0s/4m45.0s

running (1m32.0s), 101/150 VUs, 10008 complete and 0 interrupted iterations
default   [  32% ] 101/150 VUs  1m32.0s/4m45.0s

running (1m33.0s), 101/150 VUs, 10195 complete and 0 interrupted iterations
default   [  33% ] 101/150 VUs  1m33.0s/4m45.0s

running (1m34.0s), 102/150 VUs, 10380 complete and 0 interrupted iterations
default   [  33% ] 102/150 VUs  1m34.0s/4m45.0s

running (1m35.0s), 102/150 VUs, 10570 complete and 0 interrupted iterations
default   [  33% ] 102/150 VUs  1m35.0s/4m45.0s

running (1m36.0s), 103/150 VUs, 10765 complete and 0 interrupted iterations
default   [  34% ] 103/150 VUs  1m36.0s/4m45.0s

running (1m37.0s), 103/150 VUs, 10959 complete and 0 interrupted iterations
default   [  34% ] 103/150 VUs  1m37.0s/4m45.0s

running (1m38.0s), 104/150 VUs, 11156 complete and 0 interrupted iterations
default   [  34% ] 104/150 VUs  1m38.0s/4m45.0s

running (1m39.0s), 104/150 VUs, 11351 complete and 0 interrupted iterations
default   [  35% ] 104/150 VUs  1m39.0s/4m45.0s

running (1m40.0s), 105/150 VUs, 11542 complete and 0 interrupted iterations
default   [  35% ] 105/150 VUs  1m40.0s/4m45.0s

running (1m41.0s), 106/150 VUs, 11736 complete and 0 interrupted iterations
default   [  35% ] 106/150 VUs  1m41.0s/4m45.0s

running (1m42.0s), 106/150 VUs, 11941 complete and 0 interrupted iterations
default   [  36% ] 106/150 VUs  1m42.0s/4m45.0s

running (1m43.0s), 107/150 VUs, 12143 complete and 0 interrupted iterations
default   [  36% ] 107/150 VUs  1m43.0s/4m45.0s

running (1m44.0s), 107/150 VUs, 12344 complete and 0 interrupted iterations
default   [  36% ] 107/150 VUs  1m44.0s/4m45.0s

running (1m45.0s), 108/150 VUs, 12542 complete and 0 interrupted iterations
default   [  37% ] 108/150 VUs  1m45.0s/4m45.0s

running (1m46.0s), 108/150 VUs, 12741 complete and 0 interrupted iterations
default   [  37% ] 108/150 VUs  1m46.0s/4m45.0s

running (1m47.0s), 109/150 VUs, 12942 complete and 0 interrupted iterations
default   [  38% ] 109/150 VUs  1m47.0s/4m45.0s

running (1m48.0s), 109/150 VUs, 13153 complete and 0 interrupted iterations
default   [  38% ] 109/150 VUs  1m48.0s/4m45.0s

running (1m49.0s), 110/150 VUs, 13362 complete and 0 interrupted iterations
default   [  38% ] 110/150 VUs  1m49.0s/4m45.0s

running (1m50.0s), 111/150 VUs, 13568 complete and 0 interrupted iterations
default   [  39% ] 111/150 VUs  1m50.0s/4m45.0s

running (1m51.0s), 111/150 VUs, 13758 complete and 0 interrupted iterations
default   [  39% ] 111/150 VUs  1m51.0s/4m45.0s

running (1m52.0s), 112/150 VUs, 13876 complete and 0 interrupted iterations
default   [  39% ] 112/150 VUs  1m52.0s/4m45.0s

running (1m53.0s), 112/150 VUs, 14088 complete and 0 interrupted iterations
default   [  40% ] 112/150 VUs  1m53.0s/4m45.0s

running (1m54.0s), 113/150 VUs, 14260 complete and 0 interrupted iterations
default   [  40% ] 113/150 VUs  1m54.0s/4m45.0s

running (1m55.0s), 113/150 VUs, 14443 complete and 0 interrupted iterations
default   [  40% ] 113/150 VUs  1m55.0s/4m45.0s

running (1m56.0s), 114/150 VUs, 14654 complete and 0 interrupted iterations
default   [  41% ] 114/150 VUs  1m56.0s/4m45.0s

running (1m57.0s), 114/150 VUs, 14851 complete and 0 interrupted iterations
default   [  41% ] 114/150 VUs  1m57.0s/4m45.0s

running (1m58.0s), 115/150 VUs, 15072 complete and 0 interrupted iterations
default   [  41% ] 115/150 VUs  1m58.0s/4m45.0s

running (1m59.0s), 116/150 VUs, 15266 complete and 0 interrupted iterations
default   [  42% ] 116/150 VUs  1m59.0s/4m45.0s

running (2m00.0s), 116/150 VUs, 15481 complete and 0 interrupted iterations
default   [  42% ] 116/150 VUs  2m00.0s/4m45.0s

running (2m01.0s), 117/150 VUs, 15677 complete and 0 interrupted iterations
default   [  42% ] 117/150 VUs  2m01.0s/4m45.0s

running (2m02.0s), 117/150 VUs, 15884 complete and 0 interrupted iterations
default   [  43% ] 117/150 VUs  2m02.0s/4m45.0s

running (2m03.0s), 118/150 VUs, 16027 complete and 0 interrupted iterations
default   [  43% ] 118/150 VUs  2m03.0s/4m45.0s

running (2m04.0s), 118/150 VUs, 16240 complete and 0 interrupted iterations
default   [  44% ] 118/150 VUs  2m04.0s/4m45.0s

running (2m05.0s), 119/150 VUs, 16415 complete and 0 interrupted iterations
default   [  44% ] 119/150 VUs  2m05.0s/4m45.0s

running (2m06.0s), 119/150 VUs, 16604 complete and 0 interrupted iterations
default   [  44% ] 119/150 VUs  2m06.0s/4m45.0s

running (2m07.0s), 120/150 VUs, 16814 complete and 0 interrupted iterations
default   [  45% ] 120/150 VUs  2m07.0s/4m45.0s

running (2m08.0s), 121/150 VUs, 17030 complete and 0 interrupted iterations
default   [  45% ] 121/150 VUs  2m08.0s/4m45.0s

running (2m09.0s), 121/150 VUs, 17239 complete and 0 interrupted iterations
default   [  45% ] 121/150 VUs  2m09.0s/4m45.0s

running (2m10.0s), 122/150 VUs, 17424 complete and 0 interrupted iterations
default   [  46% ] 122/150 VUs  2m10.0s/4m45.0s

running (2m11.0s), 122/150 VUs, 17655 complete and 0 interrupted iterations
default   [  46% ] 122/150 VUs  2m11.0s/4m45.0s

running (2m12.0s), 123/150 VUs, 17854 complete and 0 interrupted iterations
default   [  46% ] 123/150 VUs  2m12.0s/4m45.0s

running (2m13.0s), 123/150 VUs, 18051 complete and 0 interrupted iterations
default   [  47% ] 123/150 VUs  2m13.0s/4m45.0s

running (2m14.0s), 124/150 VUs, 18251 complete and 0 interrupted iterations
default   [  47% ] 124/150 VUs  2m14.0s/4m45.0s

running (2m15.0s), 124/150 VUs, 18397 complete and 0 interrupted iterations
default   [  47% ] 124/150 VUs  2m15.0s/4m45.0s

running (2m16.0s), 125/150 VUs, 18632 complete and 0 interrupted iterations
default   [  48% ] 125/150 VUs  2m16.0s/4m45.0s

running (2m17.0s), 126/150 VUs, 18834 complete and 0 interrupted iterations
default   [  48% ] 126/150 VUs  2m17.0s/4m45.0s

running (2m18.0s), 126/150 VUs, 19033 complete and 0 interrupted iterations
default   [  48% ] 126/150 VUs  2m18.0s/4m45.0s

running (2m19.0s), 127/150 VUs, 19222 complete and 0 interrupted iterations
default   [  49% ] 127/150 VUs  2m19.0s/4m45.0s

running (2m20.0s), 127/150 VUs, 19437 complete and 0 interrupted iterations
default   [  49% ] 127/150 VUs  2m20.0s/4m45.0s

running (2m21.0s), 128/150 VUs, 19657 complete and 0 interrupted iterations
default   [  49% ] 128/150 VUs  2m21.0s/4m45.0s

running (2m22.0s), 128/150 VUs, 19884 complete and 0 interrupted iterations
default   [  50% ] 128/150 VUs  2m22.0s/4m45.0s

running (2m23.0s), 129/150 VUs, 20103 complete and 0 interrupted iterations
default   [  50% ] 129/150 VUs  2m23.0s/4m45.0s

running (2m24.0s), 129/150 VUs, 20328 complete and 0 interrupted iterations
default   [  51% ] 129/150 VUs  2m24.0s/4m45.0s

running (2m25.0s), 130/150 VUs, 20558 complete and 0 interrupted iterations
default   [  51% ] 130/150 VUs  2m25.0s/4m45.0s

running (2m26.0s), 131/150 VUs, 20778 complete and 0 interrupted iterations
default   [  51% ] 131/150 VUs  2m26.0s/4m45.0s

running (2m27.0s), 131/150 VUs, 21004 complete and 0 interrupted iterations
default   [  52% ] 131/150 VUs  2m27.0s/4m45.0s

running (2m28.0s), 132/150 VUs, 21229 complete and 0 interrupted iterations
default   [  52% ] 132/150 VUs  2m28.0s/4m45.0s

running (2m29.0s), 132/150 VUs, 21459 complete and 0 interrupted iterations
default   [  52% ] 132/150 VUs  2m29.0s/4m45.0s

running (2m30.0s), 133/150 VUs, 21697 complete and 0 interrupted iterations
default   [  53% ] 133/150 VUs  2m30.0s/4m45.0s

running (2m31.0s), 133/150 VUs, 21924 complete and 0 interrupted iterations
default   [  53% ] 133/150 VUs  2m31.0s/4m45.0s

running (2m32.0s), 134/150 VUs, 22149 complete and 0 interrupted iterations
default   [  53% ] 134/150 VUs  2m32.0s/4m45.0s

running (2m33.0s), 134/150 VUs, 22387 complete and 0 interrupted iterations
default   [  54% ] 134/150 VUs  2m33.0s/4m45.0s

running (2m34.0s), 135/150 VUs, 22621 complete and 0 interrupted iterations
default   [  54% ] 135/150 VUs  2m34.0s/4m45.0s

running (2m35.0s), 136/150 VUs, 22848 complete and 0 interrupted iterations
default   [  54% ] 136/150 VUs  2m35.0s/4m45.0s

running (2m36.0s), 136/150 VUs, 23079 complete and 0 interrupted iterations
default   [  55% ] 136/150 VUs  2m36.0s/4m45.0s

running (2m37.0s), 137/150 VUs, 23295 complete and 0 interrupted iterations
default   [  55% ] 137/150 VUs  2m37.0s/4m45.0s

running (2m38.0s), 137/150 VUs, 23505 complete and 0 interrupted iterations
default   [  55% ] 137/150 VUs  2m38.0s/4m45.0s

running (2m39.0s), 138/150 VUs, 23734 complete and 0 interrupted iterations
default   [  56% ] 138/150 VUs  2m39.0s/4m45.0s

running (2m40.0s), 138/150 VUs, 23955 complete and 0 interrupted iterations
default   [  56% ] 138/150 VUs  2m40.0s/4m45.0s

running (2m41.0s), 139/150 VUs, 24159 complete and 0 interrupted iterations
default   [  56% ] 139/150 VUs  2m41.0s/4m45.0s

running (2m42.0s), 139/150 VUs, 24365 complete and 0 interrupted iterations
default   [  57% ] 139/150 VUs  2m42.0s/4m45.0s

running (2m43.0s), 140/150 VUs, 24569 complete and 0 interrupted iterations
default   [  57% ] 140/150 VUs  2m43.0s/4m45.0s

running (2m44.0s), 141/150 VUs, 24780 complete and 0 interrupted iterations
default   [  58% ] 141/150 VUs  2m44.0s/4m45.0s

running (2m45.0s), 141/150 VUs, 24987 complete and 0 interrupted iterations
default   [  58% ] 141/150 VUs  2m45.0s/4m45.0s

running (2m46.0s), 142/150 VUs, 25211 complete and 0 interrupted iterations
default   [  58% ] 142/150 VUs  2m46.0s/4m45.0s

running (2m47.0s), 142/150 VUs, 25450 complete and 0 interrupted iterations
default   [  59% ] 142/150 VUs  2m47.0s/4m45.0s

running (2m48.0s), 143/150 VUs, 25637 complete and 0 interrupted iterations
default   [  59% ] 143/150 VUs  2m48.0s/4m45.0s

running (2m49.0s), 143/150 VUs, 25877 complete and 0 interrupted iterations
default   [  59% ] 143/150 VUs  2m49.0s/4m45.0s

running (2m50.0s), 144/150 VUs, 26100 complete and 0 interrupted iterations
default   [  60% ] 144/150 VUs  2m50.0s/4m45.0s

running (2m51.0s), 144/150 VUs, 26302 complete and 0 interrupted iterations
default   [  60% ] 144/150 VUs  2m51.0s/4m45.0s

running (2m52.0s), 145/150 VUs, 26410 complete and 0 interrupted iterations
default   [  60% ] 145/150 VUs  2m52.0s/4m45.0s

running (2m53.0s), 146/150 VUs, 26602 complete and 0 interrupted iterations
default   [  61% ] 146/150 VUs  2m53.0s/4m45.0s

running (2m54.0s), 146/150 VUs, 26796 complete and 0 interrupted iterations
default   [  61% ] 146/150 VUs  2m54.0s/4m45.0s

running (2m55.0s), 147/150 VUs, 27014 complete and 0 interrupted iterations
default   [  61% ] 147/150 VUs  2m55.0s/4m45.0s

running (2m56.0s), 147/150 VUs, 27224 complete and 0 interrupted iterations
default   [  62% ] 147/150 VUs  2m56.0s/4m45.0s

running (2m57.0s), 148/150 VUs, 27445 complete and 0 interrupted iterations
default   [  62% ] 148/150 VUs  2m57.0s/4m45.0s

running (2m58.0s), 148/150 VUs, 27681 complete and 0 interrupted iterations
default   [  62% ] 148/150 VUs  2m58.0s/4m45.0s

running (2m59.0s), 149/150 VUs, 27913 complete and 0 interrupted iterations
default   [  63% ] 149/150 VUs  2m59.0s/4m45.0s

running (3m00.0s), 149/150 VUs, 28141 complete and 0 interrupted iterations
default   [  63% ] 149/150 VUs  3m00.0s/4m45.0s

running (3m01.0s), 150/150 VUs, 28369 complete and 0 interrupted iterations
default   [  64% ] 150/150 VUs  3m01.0s/4m45.0s

running (3m02.0s), 150/150 VUs, 28601 complete and 0 interrupted iterations
default   [  64% ] 150/150 VUs  3m02.0s/4m45.0s

running (3m03.0s), 150/150 VUs, 28830 complete and 0 interrupted iterations
default   [  64% ] 150/150 VUs  3m03.0s/4m45.0s

running (3m04.0s), 150/150 VUs, 29046 complete and 0 interrupted iterations
default   [  65% ] 150/150 VUs  3m04.0s/4m45.0s

running (3m05.0s), 150/150 VUs, 29283 complete and 0 interrupted iterations
default   [  65% ] 150/150 VUs  3m05.0s/4m45.0s

running (3m06.0s), 150/150 VUs, 29513 complete and 0 interrupted iterations
default   [  65% ] 150/150 VUs  3m06.0s/4m45.0s

running (3m07.0s), 150/150 VUs, 29742 complete and 0 interrupted iterations
default   [  66% ] 150/150 VUs  3m07.0s/4m45.0s

running (3m08.0s), 150/150 VUs, 29963 complete and 0 interrupted iterations
default   [  66% ] 150/150 VUs  3m08.0s/4m45.0s

running (3m09.0s), 150/150 VUs, 30181 complete and 0 interrupted iterations
default   [  66% ] 150/150 VUs  3m09.0s/4m45.0s

running (3m10.0s), 150/150 VUs, 30416 complete and 0 interrupted iterations
default   [  67% ] 150/150 VUs  3m10.0s/4m45.0s

running (3m11.0s), 150/150 VUs, 30639 complete and 0 interrupted iterations
default   [  67% ] 150/150 VUs  3m11.0s/4m45.0s

running (3m12.0s), 150/150 VUs, 30854 complete and 0 interrupted iterations
default   [  67% ] 150/150 VUs  3m12.0s/4m45.0s

running (3m13.0s), 150/150 VUs, 31071 complete and 0 interrupted iterations
default   [  68% ] 150/150 VUs  3m13.0s/4m45.0s

running (3m14.0s), 150/150 VUs, 31299 complete and 0 interrupted iterations
default   [  68% ] 150/150 VUs  3m14.0s/4m45.0s

running (3m15.0s), 150/150 VUs, 31468 complete and 0 interrupted iterations
default   [  68% ] 150/150 VUs  3m15.0s/4m45.0s

running (3m16.0s), 150/150 VUs, 31699 complete and 0 interrupted iterations
default   [  69% ] 150/150 VUs  3m16.0s/4m45.0s

running (3m17.0s), 150/150 VUs, 31931 complete and 0 interrupted iterations
default   [  69% ] 150/150 VUs  3m17.0s/4m45.0s

running (3m18.0s), 150/150 VUs, 32145 complete and 0 interrupted iterations
default   [  69% ] 150/150 VUs  3m18.0s/4m45.0s

running (3m19.0s), 150/150 VUs, 32352 complete and 0 interrupted iterations
default   [  70% ] 150/150 VUs  3m19.0s/4m45.0s

running (3m20.0s), 150/150 VUs, 32559 complete and 0 interrupted iterations
default   [  70% ] 150/150 VUs  3m20.0s/4m45.0s

running (3m21.0s), 150/150 VUs, 32788 complete and 0 interrupted iterations
default   [  71% ] 150/150 VUs  3m21.0s/4m45.0s

running (3m22.0s), 150/150 VUs, 33013 complete and 0 interrupted iterations
default   [  71% ] 150/150 VUs  3m22.0s/4m45.0s

running (3m23.0s), 150/150 VUs, 33240 complete and 0 interrupted iterations
default   [  71% ] 150/150 VUs  3m23.0s/4m45.0s

running (3m24.0s), 150/150 VUs, 33453 complete and 0 interrupted iterations
default   [  72% ] 150/150 VUs  3m24.0s/4m45.0s

running (3m25.0s), 150/150 VUs, 33671 complete and 0 interrupted iterations
default   [  72% ] 150/150 VUs  3m25.0s/4m45.0s

running (3m26.0s), 150/150 VUs, 33868 complete and 0 interrupted iterations
default   [  72% ] 150/150 VUs  3m26.0s/4m45.0s

running (3m27.0s), 150/150 VUs, 34057 complete and 0 interrupted iterations
default   [  73% ] 150/150 VUs  3m27.0s/4m45.0s

running (3m28.0s), 150/150 VUs, 34280 complete and 0 interrupted iterations
default   [  73% ] 150/150 VUs  3m28.0s/4m45.0s

running (3m29.0s), 150/150 VUs, 34515 complete and 0 interrupted iterations
default   [  73% ] 150/150 VUs  3m29.0s/4m45.0s

running (3m30.0s), 150/150 VUs, 34751 complete and 0 interrupted iterations
default   [  74% ] 150/150 VUs  3m30.0s/4m45.0s

running (3m31.0s), 150/150 VUs, 34984 complete and 0 interrupted iterations
default   [  74% ] 150/150 VUs  3m31.0s/4m45.0s

running (3m32.0s), 150/150 VUs, 35238 complete and 0 interrupted iterations
default   [  74% ] 150/150 VUs  3m32.0s/4m45.0s

running (3m33.0s), 150/150 VUs, 35447 complete and 0 interrupted iterations
default   [  75% ] 150/150 VUs  3m33.0s/4m45.0s

running (3m34.0s), 150/150 VUs, 35648 complete and 0 interrupted iterations
default   [  75% ] 150/150 VUs  3m34.0s/4m45.0s

running (3m35.0s), 150/150 VUs, 35859 complete and 0 interrupted iterations
default   [  75% ] 150/150 VUs  3m35.0s/4m45.0s

running (3m36.0s), 150/150 VUs, 35989 complete and 0 interrupted iterations
default   [  76% ] 150/150 VUs  3m36.0s/4m45.0s

running (3m37.0s), 150/150 VUs, 36202 complete and 0 interrupted iterations
default   [  76% ] 150/150 VUs  3m37.0s/4m45.0s

running (3m38.0s), 150/150 VUs, 36428 complete and 0 interrupted iterations
default   [  76% ] 150/150 VUs  3m38.0s/4m45.0s

running (3m39.0s), 150/150 VUs, 36658 complete and 0 interrupted iterations
default   [  77% ] 150/150 VUs  3m39.0s/4m45.0s

running (3m40.0s), 150/150 VUs, 36890 complete and 0 interrupted iterations
default   [  77% ] 150/150 VUs  3m40.0s/4m45.0s

running (3m41.0s), 150/150 VUs, 37126 complete and 0 interrupted iterations
default   [  78% ] 150/150 VUs  3m41.0s/4m45.0s

running (3m42.0s), 150/150 VUs, 37370 complete and 0 interrupted iterations
default   [  78% ] 150/150 VUs  3m42.0s/4m45.0s

running (3m43.0s), 150/150 VUs, 37601 complete and 0 interrupted iterations
default   [  78% ] 150/150 VUs  3m43.0s/4m45.0s

running (3m44.0s), 150/150 VUs, 37830 complete and 0 interrupted iterations
default   [  79% ] 150/150 VUs  3m44.0s/4m45.0s

running (3m45.0s), 150/150 VUs, 38047 complete and 0 interrupted iterations
default   [  79% ] 150/150 VUs  3m45.0s/4m45.0s

running (3m46.0s), 150/150 VUs, 38256 complete and 0 interrupted iterations
default   [  79% ] 150/150 VUs  3m46.0s/4m45.0s

running (3m47.0s), 150/150 VUs, 38486 complete and 0 interrupted iterations
default   [  80% ] 150/150 VUs  3m47.0s/4m45.0s

running (3m48.0s), 150/150 VUs, 38721 complete and 0 interrupted iterations
default   [  80% ] 150/150 VUs  3m48.0s/4m45.0s

running (3m49.0s), 150/150 VUs, 38925 complete and 0 interrupted iterations
default   [  80% ] 150/150 VUs  3m49.0s/4m45.0s

running (3m50.0s), 150/150 VUs, 39134 complete and 0 interrupted iterations
default   [  81% ] 150/150 VUs  3m50.0s/4m45.0s

running (3m51.0s), 150/150 VUs, 39353 complete and 0 interrupted iterations
default   [  81% ] 150/150 VUs  3m51.0s/4m45.0s

running (3m52.0s), 150/150 VUs, 39473 complete and 0 interrupted iterations
default   [  81% ] 150/150 VUs  3m52.0s/4m45.0s

running (3m53.0s), 150/150 VUs, 39683 complete and 0 interrupted iterations
default   [  82% ] 150/150 VUs  3m53.0s/4m45.0s

running (3m54.0s), 150/150 VUs, 39892 complete and 0 interrupted iterations
default   [  82% ] 150/150 VUs  3m54.0s/4m45.0s

running (3m55.0s), 150/150 VUs, 40116 complete and 0 interrupted iterations
default   [  82% ] 150/150 VUs  3m55.0s/4m45.0s

running (3m56.0s), 150/150 VUs, 40336 complete and 0 interrupted iterations
default   [  83% ] 150/150 VUs  3m56.0s/4m45.0s

running (3m57.0s), 150/150 VUs, 40554 complete and 0 interrupted iterations
default   [  83% ] 150/150 VUs  3m57.0s/4m45.0s

running (3m58.0s), 150/150 VUs, 40760 complete and 0 interrupted iterations
default   [  84% ] 150/150 VUs  3m58.0s/4m45.0s

running (3m59.0s), 150/150 VUs, 40978 complete and 0 interrupted iterations
default   [  84% ] 150/150 VUs  3m59.0s/4m45.0s

running (4m00.0s), 150/150 VUs, 41211 complete and 0 interrupted iterations
default   [  84% ] 150/150 VUs  4m00.0s/4m45.0s

running (4m01.0s), 150/150 VUs, 41412 complete and 0 interrupted iterations
default   [  85% ] 150/150 VUs  4m01.0s/4m45.0s

running (4m02.0s), 145/150 VUs, 41639 complete and 0 interrupted iterations
default   [  85% ] 145/150 VUs  4m02.0s/4m45.0s

running (4m03.0s), 142/150 VUs, 41855 complete and 0 interrupted iterations
default   [  85% ] 142/150 VUs  4m03.0s/4m45.0s

running (4m04.0s), 138/150 VUs, 42070 complete and 0 interrupted iterations
default   [  86% ] 138/150 VUs  4m04.0s/4m45.0s

running (4m05.0s), 134/150 VUs, 42289 complete and 0 interrupted iterations
default   [  86% ] 134/150 VUs  4m05.0s/4m45.0s

running (4m06.0s), 131/150 VUs, 42494 complete and 0 interrupted iterations
default   [  86% ] 131/150 VUs  4m06.0s/4m45.0s

running (4m07.0s), 128/150 VUs, 42679 complete and 0 interrupted iterations
default   [  87% ] 128/150 VUs  4m07.0s/4m45.0s

running (4m08.0s), 125/150 VUs, 42889 complete and 0 interrupted iterations
default   [  87% ] 125/150 VUs  4m08.0s/4m45.0s

running (4m09.0s), 122/150 VUs, 43092 complete and 0 interrupted iterations
default   [  87% ] 122/150 VUs  4m09.0s/4m45.0s

running (4m10.0s), 117/150 VUs, 43314 complete and 0 interrupted iterations
default   [  88% ] 117/150 VUs  4m10.0s/4m45.0s

running (4m11.0s), 115/150 VUs, 43517 complete and 0 interrupted iterations
default   [  88% ] 115/150 VUs  4m11.0s/4m45.0s

running (4m12.0s), 111/150 VUs, 43734 complete and 0 interrupted iterations
default   [  88% ] 111/150 VUs  4m12.0s/4m45.0s

running (4m13.0s), 107/150 VUs, 43931 complete and 0 interrupted iterations
default   [  89% ] 107/150 VUs  4m13.0s/4m45.0s

running (4m14.0s), 106/150 VUs, 44131 complete and 0 interrupted iterations
default   [  89% ] 106/150 VUs  4m14.0s/4m45.0s

running (4m15.0s), 102/150 VUs, 44283 complete and 0 interrupted iterations
default   [  89% ] 102/150 VUs  4m15.0s/4m45.0s

running (4m16.0s), 099/150 VUs, 44443 complete and 0 interrupted iterations
default   [  90% ] 099/150 VUs  4m16.0s/4m45.0s

running (4m17.0s), 095/150 VUs, 44630 complete and 0 interrupted iterations
default   [  90% ] 095/150 VUs  4m17.0s/4m45.0s

running (4m18.0s), 091/150 VUs, 44799 complete and 0 interrupted iterations
default   [  91% ] 091/150 VUs  4m18.0s/4m45.0s

running (4m19.0s), 089/150 VUs, 44962 complete and 0 interrupted iterations
default   [  91% ] 089/150 VUs  4m19.0s/4m45.0s

running (4m20.0s), 085/150 VUs, 45131 complete and 0 interrupted iterations
default   [  91% ] 085/150 VUs  4m20.0s/4m45.0s

running (4m21.0s), 082/150 VUs, 45280 complete and 0 interrupted iterations
default   [  92% ] 082/150 VUs  4m21.0s/4m45.0s

running (4m22.0s), 078/150 VUs, 45433 complete and 0 interrupted iterations
default   [  92% ] 078/150 VUs  4m22.0s/4m45.0s

running (4m23.0s), 075/150 VUs, 45574 complete and 0 interrupted iterations
default   [  92% ] 075/150 VUs  4m23.0s/4m45.0s

running (4m24.0s), 071/150 VUs, 45714 complete and 0 interrupted iterations
default   [  93% ] 071/150 VUs  4m24.0s/4m45.0s

running (4m25.0s), 068/150 VUs, 45847 complete and 0 interrupted iterations
default   [  93% ] 068/150 VUs  4m25.0s/4m45.0s

running (4m26.0s), 065/150 VUs, 45976 complete and 0 interrupted iterations
default   [  93% ] 065/150 VUs  4m26.0s/4m45.0s

running (4m27.0s), 061/150 VUs, 46096 complete and 0 interrupted iterations
default   [  94% ] 061/150 VUs  4m27.0s/4m45.0s

running (4m28.0s), 058/150 VUs, 46209 complete and 0 interrupted iterations
default   [  94% ] 058/150 VUs  4m28.0s/4m45.0s

running (4m29.0s), 055/150 VUs, 46319 complete and 0 interrupted iterations
default   [  94% ] 055/150 VUs  4m29.0s/4m45.0s

running (4m30.0s), 052/150 VUs, 46420 complete and 0 interrupted iterations
default   [  95% ] 052/150 VUs  4m30.0s/4m45.0s

running (4m31.0s), 048/150 VUs, 46520 complete and 0 interrupted iterations
default   [  95% ] 048/150 VUs  4m31.0s/4m45.0s

running (4m32.0s), 046/150 VUs, 46606 complete and 0 interrupted iterations
default   [  95% ] 046/150 VUs  4m32.0s/4m45.0s

running (4m33.0s), 042/150 VUs, 46692 complete and 0 interrupted iterations
default   [  96% ] 042/150 VUs  4m33.0s/4m45.0s

running (4m34.0s), 037/150 VUs, 46772 complete and 0 interrupted iterations
default   [  96% ] 037/150 VUs  4m34.0s/4m45.0s

running (4m35.0s), 034/150 VUs, 46839 complete and 0 interrupted iterations
default   [  96% ] 034/150 VUs  4m35.0s/4m45.0s

running (4m36.0s), 032/150 VUs, 46895 complete and 0 interrupted iterations
default   [  97% ] 032/150 VUs  4m36.0s/4m45.0s

running (4m37.0s), 028/150 VUs, 46957 complete and 0 interrupted iterations
default   [  97% ] 028/150 VUs  4m37.0s/4m45.0s

running (4m38.0s), 025/150 VUs, 47011 complete and 0 interrupted iterations
default   [  98% ] 025/150 VUs  4m38.0s/4m45.0s

running (4m39.0s), 021/150 VUs, 47057 complete and 0 interrupted iterations
default   [  98% ] 021/150 VUs  4m39.0s/4m45.0s

running (4m40.0s), 019/150 VUs, 47079 complete and 0 interrupted iterations
default   [  98% ] 019/150 VUs  4m40.0s/4m45.0s

running (4m41.0s), 015/150 VUs, 47115 complete and 0 interrupted iterations
default   [  99% ] 015/150 VUs  4m41.0s/4m45.0s

running (4m42.0s), 012/150 VUs, 47144 complete and 0 interrupted iterations
default   [  99% ] 012/150 VUs  4m42.0s/4m45.0s

running (4m43.0s), 008/150 VUs, 47166 complete and 0 interrupted iterations
default   [  99% ] 008/150 VUs  4m43.0s/4m45.0s

running (4m44.0s), 004/150 VUs, 47180 complete and 0 interrupted iterations
default   [ 100% ] 004/150 VUs  4m44.0s/4m45.0s

running (4m45.0s), 002/150 VUs, 47184 complete and 0 interrupted iterations
default   [ 100% ] 002/150 VUs  4m45.0s/4m45.0s


  █ TOTAL RESULTS 

    checks_total.......: 94374   330.510455/s
    checks_succeeded...: 100.00% 94374 out of 94374
    checks_failed......: 0.00%   0 out of 94374

    ✓ login 200
    ✓ login contains form

    HTTP
    http_req_duration..............: avg=110.74ms min=16.82ms  med=52.76ms  max=1.31s p(90)=277.8ms  p(95)=347.11ms
      { expected_response:true }...: avg=110.74ms min=16.82ms  med=52.76ms  max=1.31s p(90)=277.8ms  p(95)=347.11ms
    http_req_failed................: 0.00%  0 out of 47187
    http_reqs......................: 47187  165.255227/s

    EXECUTION
    iteration_duration.............: avg=611.74ms min=517.31ms med=553.91ms max=1.81s p(90)=778.98ms p(95)=847.95ms
    iterations.....................: 47187  165.255227/s
    vus............................: 2      min=2          max=150
    vus_max........................: 150    min=150        max=150

    NETWORK
    data_received..................: 434 MB 1.5 MB/s
    data_sent......................: 4.7 MB 17 kB/s



running (4m45.5s), 000/150 VUs, 47187 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/150 VUs  4m45s